1
1/10
10
10/10
100
15
2
2/10
20
3
30
4
4/10
5
6
7
7/10
8
8/10
80's
9
9/10
90
a
ability
able
about
above
absolute
absolutely
accent
across
act
acted
acting
action
actor
actress
actual
actually
adaptation
add
added
admit
adult
adventure
after
again
against
age
ago
agree
ain
air
alien
all
almost
alone
along
already
also
although
always
am
amazing
america
american
among
amount
amusing
an
and
animal
animated
animation
annoying
another
answer
anti
any
anyone
anything
anyway
apart
apparently
appeal
appear
appearance
appeared
appears
appreciate
are
around
art
artist
as
aside
ask
aspect
at
atmosphere
attack
attempt
attention
attractive
audience
available
average
avoid
award
away
awesome
awful
b
baby
back
background
bad
badly
band
barely
based
basic
basically
battle
be
beautiful
beautifully
beauty
became
because
become
becomes
been
before
begin
beginning
begins
behind
being
believable
believe
ben
best
better
between
beyond
big
biggest
bill
bit
bizarre
black
blood
blue
body
book
bored
boring
both
bother
bottom
bought
box
boy
british
budget
bunch
business
but
buy
by
c
call
called
came
camera
camp
can
cannot
car
care
career
cartoon
case
cast
casting
cat
catch
caught
cause
century
certain
certainly
chance
change
changed
channel
character
charm
charming
chase
cheap
check
cheesy
chemistry
child
choice
christmas
christopher
cinema
cinematography
city
class
classic
clear
clearly
clever
cliché
close
co
cold
collection
college
color
come
comedy
comes
comic
coming
comment
common
compared
compelling
complete
completely
complex
computer
concept
conclusion
confusing
consider
considered
considering
control
convincing
cool
cop
copy
cost
costume
could
country
couple
course
cover
crap
crazy
create
created
creature
credit
creepy
crew
crime
critic
cry
cult
culture
cut
cute
d
damn
dance
dancing
dark
date
daughter
david
day
de
dead
deal
death
decent
decide
decided
deep
definitely
deliver
depth
describe
deserves
design
despite
detail
detective
developed
development
dialog
dialogue
did
die
died
different
difficult
direct
directed
directing
direction
director
disappointed
disappointing
disappointment
disney
disturbing
do
doctor
documentary
does
dog
doing
done
doubt
down
dr
drama
dramatic
dreadful
dream
drug
due
dull
dumb
during
dvd
e
each
eak
earlier
early
earth
easily
easy
edge
editing
effect
effective
effort
either
element
else
emotion
emotional
end
ended
ending
ends
english
enjoy
enjoyable
enjoyed
enough
entertaining
entertainment
entire
entirely
episode
equally
era
escape
especially
etc
even
event
eventually
ever
every
everyone
everything
evil
exactly
example
excellent
except
exception
exciting
excuse
expect
expectation
expected
expecting
experience
explain
extra
extremely
eye
face
fact
failed
fails
fair
fairly
fake
fall
falls
familiar
family
famous
fan
fantastic
fantasy
far
fascinating
fast
father
favorite
fear
feature
feel
feeling
fell
felt
female
festival
few
fi
fiction
fight
fighting
figure
filled
film
film's
filmed
filming
filmmaker
final
finally
find
finds
fine
finish
fire
first
fit
five
flat
flaw
flick
focus
follow
following
footage
for
force
forced
forget
forgettable
form
former
forward
found
four
frank
free
french
fresh
friend
from
front
full
fun
funniest
funny
further
future
g
gag
game
garbage
gave
gay
gem
general
generally
genius
genre
george
get
gets
getting
ghost
girl
girlfriend
give
given
gives
giving
glad
go
god
goes
going
gone
good
gore
got
grade
graphic
great
greatest
group
guess
gun
guy
had
half
hand
happen
happened
happening
happens
happy
hard
hardly
has
hate
have
having
he
head
hear
heard
heart
heavy
hell
help
her
here
hero
herself
hey
high
highly
hilarious
him
himself
his
history
hit
hold
hole
hollywood
home
honest
honestly
hope
hoping
horrible
horror
hot
hour
house
how
however
huge
human
humor
humour
husband
i
idea
if
illiant
image
imagine
imdb
important
impossible
impression
impressive
in
including
incredible
incredibly
indeed
indian
ing
ings
inside
instead
insult
intelligent
interest
interested
interesting
into
involved
involving
is
issue
it
italian
its
itself
jack
jame
jane
japanese
jason
jean
jim
job
joe
john
joke
journey
just
keep
keeps
kept
kid
kill
killed
killer
killing
kind
king
knew
know
known
knows
lack
lacks
lady
lame
language
large
last
late
later
laugh
laughable
laughed
laughing
law
lead
leading
learn
least
leave
leaves
lee
left
less
let
let's
level
life
light
lighting
likable
like
liked
likely
line
list
literally
little
live
living
local
location
long
look
looked
looking
looks
lost
lot
loud
love
loved
lovely
lover
low
mad
made
main
mainly
major
make
maker
makes
making
male
man
manage
managed
manner
many
mark
married
mary
master
masterpiece
match
material
matter
may
maybe
me
mean
meaning
meant
mediocre
meet
member
memorable
memory
mention
mentioned
mess
message
michael
middle
might
million
mind
minute
miss
missed
missing
mistake
mix
modern
moment
money
monster
mood
more
most
mostly
mother
motion
move
movie
moving
mr
much
murder
music
musical
must
my
myself
mystery
name
named
narrative
natural
nature
near
nearly
need
needed
needs
neither
never
new
next
nice
night
nightmare
no
noir
non
none
nor
normal
not
note
nothing
novel
now
nowhere
nudity
number
o
obvious
obviously
odd
of
off
offer
office
often
oh
ok
okay
old
older
on
once
one
only
open
opening
opera
opinion
opportunity
or
order
original
oscar
other
otherwise
ought
our
out
outside
outstanding
over
overall
own
pace
painful
parent
part
particular
particularly
party
pass
past
pathetic
paul
pay
perfect
perfectly
performance
perhaps
period
person
personal
personality
personally
peter
photography
picture
piece
place
plain
plan
play
played
player
playing
plays
please
plenty
plot
plus
point
pointless
police
political
poor
poorly
popular
portrayal
portrayed
positive
possible
possibly
post
potential
power
powerful
predictable
premise
presence
present
pretty
previous
probably
problem
produced
producer
production
professional
project
public
pure
purpose
put
puts
quality
question
quickly
quite
rare
rate
rated
rather
rating
re
read
reading
real
realistic
reality
realize
really
reason
recent
recently
recommend
recommended
red
redeeming
refreshing
relationship
release
released
remains
remake
remember
rent
respect
rest
result
return
revenge
review
reviewer
rich
richard
ride
ridiculous
right
road
robert
rock
role
romance
romantic
room
run
running
s
sad
sadly
said
same
save
saw
say
saying
says
scary
scene
scenery
school
sci
science
score
scott
screen
screenplay
script
season
second
secret
see
seeing
seem
seemed
seems
seen
self
sense
sequel
sequence
serial
series
serious
seriously
set
setting
several
sex
sexual
sexy
shame
she
shock
shoot
short
shot
should
show
showed
showing
shown
shows
sick
side
silent
silly
similar
simple
simply
since
singing
single
sister
sit
sitting
situation
skill
slasher
slightly
slow
small
smart
so
social
society
soldier
solid
some
somehow
someone
something
sometimes
somewhat
somewhere
son
song
soon
sorry
sort
soul
sound
sounds
soundtrack
south
space
speak
special
spend
spent
spirit
spoiler
spot
stage
stand
standard
stands
star
starring
start
started
starts
state
stay
step
stephen
stereotype
steve
stick
still
stop
store
story
storyline
straight
strange
street
strong
student
studio
stuff
stunning
stupid
style
sub
subject
subtle
success
such
suddenly
suit
super
superb
support
supporting
supposed
sure
surely
surprise
surprised
surprisingly
suspense
sweet
t
take
taken
takes
taking
tale
talent
talented
talk
talking
taste
team
tear
teen
teenager
television
tell
telling
tells
ten
tension
term
terrible
terrific
than
thank
that
the
theater
their
them
theme
themselves
then
there
these
they
thin
thing
think
thinking
third
this
those
though
thought
three
thriller
through
throughout
time
title
to
today
together
told
tom
tone
too
took
top
total
totally
touch
touching
tough
toward
town
track
trailer
trash
tried
tries
trip
trouble
true
truly
truth
try
trying
turn
turned
turns
tv
twist
two
type
typical
ugly
ultimately
unbelievable
under
understand
unfortunately
unfunny
unique
unless
unlike
until
up
upon
us
use
used
using
usual
usually
utterly
value
vampire
van
various
version
very
victim
video
view
viewer
viewing
villain
violence
violent
visual
voice
wait
waiting
walk
wall
want
wanted
wants
war
was
waste
wasted
watch
watched
watching
water
way
we
weak
week
weird
well
went
were
west
western
what
whatever
whatsoever
when
where
whether
which
while
white
who
who's
whole
whom
whose
why
wife
wild
will
william
win
wish
with
within
without
woman
won
wonder
wonderful
wonderfully
wood
wooden
word
work
worked
working
works
world
worse
worst
worth
worthy
would
wow
write
writer
writing
written
wrong
wrote
yeah
year
yes
yet
york
you
young
younger
your
yourself
zombie
